[
  {
    "id": 1766342977518,
    "disciplina": "matematica",
    "tema": "lei dos cossenos",
    "resumo": "A Lei dos Cossenos é usada para calcular um lado ou ângulo desconhecido em qualquer triângulo (acutângulo, obtusângulo ou retângulo), desde que se conheçam outras medidas.\n\nEla afirma que:\n\nO quadrado de um lado de um triângulo é igual à soma dos quadrados dos outros dois lados, menos o dobro do produto desses lados pelo cosseno do ângulo entre eles.\n\nFórmula geral:\n\n𝑎\n2\n=\n𝑏\n2\n+\n𝑐\n2\n−\n2\n𝑏\n𝑐\n⋅\ncos\n⁡\n𝐴\na\n2\n=b\n2\n+c\n2\n−2bc⋅cosA\n\nAplicações:\n\nCalcular um lado, conhecendo dois lados e o ângulo entre eles.\n\nCalcular um ângulo, conhecendo os três lados do triângulo.\n\nObservação:\nOs valores do cosseno dos ângulos são obtidos por meio da tabela trigonométrica ou calculadora.",
    "conteudoCompleto": "A Lei dos Cossenos é utilizada para calcular a medida de um lado ou de um ângulo desconhecido de um triângulo qualquer, conhecendo suas outras medidas.\n\nA lei dos cossenos pode ser aplicada em qualquer triângulo. Seja ele acutângulo (ângulos internos menores que 90º), obtusângulo (com um ângulo interno maior que 90º), ou retângulo (com um ângulo interno igual a 90º).\n\nO teorema dos cossenos estabelece que:\n\n\"Em qualquer triângulo, o quadrado de um dos lados corresponde à soma dos quadrados dos outros dois lados, menos o dobro do produto desses dois lados pelo cosseno do ângulo entre eles.\"\n\nFórmula da Lei dos Cossenos\nAssim, pela lei dos cossenos temos as seguintes relações entre os lados e os ângulos de um triângulo:\n\nLei dos Cossenos\n\nExemplo 1: Dois lados de um triângulo medem 20 cm e 12 cm e formam entre si um ângulo de 120º. Calcule a medida do terceiro lado.\n\nResolução:\n\nPara calcular a medida do terceiro lado utilizaremos a lei dos cossenos. Para isso, vamos considerar:\n\nb = 20 cm\nc = 12 cm\ncos α = cos 120º = - 0,5 (valor encontrado em tabelas trigonométricas).\n\nSubstituindo esses valores na fórmula:\n\na2 = 202 + 122 - 2 . 20 . 12 . (- 0,5)\na2 = 400 + 144 + 240\na2 = 784\na = √784\na = 28 cm\n\nConclusão:\n\nO terceiro lado mede 28 cm.\n\nExemplo 2: Determine a medida do lado AC e a medida do ângulo com vértice em A da figura a seguir:\n\nExemplo lei dos cossenos\n\nResolução:\n\nPrimeiramente, vamos determinar o AC = b:\n\nb2 = 82 + 102 – 2 . 8 . 10 . cos 50º\nb2 = 164 – 160 . cos 50º\nb2 = 164 – 160 . 0,64279\nb ≈ 7,82\n\nAgora, vamos determinar a medida do ângulo pela lei dos cossenos:\n\n82 = 102 + 7,822 – 2 . 10 . 7,82 . cos Â\n64 = 161,1524 – 156,4 . cos Â\ncos Â = 0,62\nÂ = 52º\n\nObs: Para encontrar os valores dos ângulos do cosseno utilizamos a Tabela Trigonométrica. Nela, temos os valores dos ângulos de 1º a 90º para cada função trigonométrica (seno, cosseno e tangente).",
    "dataCriacao": "2025-12-21T18:49:37.518Z"
  },
  {
    "id": 1766403544933,
    "disciplina": "matematica",
    "tema": "dasda",
    "resumo": "SDASDASD",
    "conteudoCompleto": "ASDASDAS",
    "dataCriacao": "2025-12-22T11:39:04.933Z"
  }
]