[
  {
    "id": 1766932108297,
    "disciplina": "matematica",
    "tema": "função quadrática",
    "resumo": "A função quadrática é dada por f(x) = ax² + bx + c, com a ≠ 0. Seu polinômio é de grau 2.\nO domínio é ℝ e o contradomínio é ℝ; a imagem depende do vértice e da concavidade da parábola.\n\nO gráfico é uma parábola, que pode cortar o eixo x em até dois pontos (raízes), conforme o discriminante Δ:\n\nΔ > 0: duas raízes reais;\n\nΔ = 0: uma raiz real (tangencia o eixo x);\n\nΔ < 0: não há raízes reais.\n\nParâmetros:\n\na: define a concavidade (a > 0 para cima; a < 0 para baixo);\n\nb: indica se a parábola cruza o eixo y na subida (b > 0) ou descida (b < 0);\n\nc: é a ordenada do ponto onde a parábola corta o eixo y.\n\nAs raízes são os valores de x que tornam f(x) = 0 e podem ser encontradas pela Fórmula de Bhaskara.\nExemplo: em f(x) = x² − 5x + 6, as raízes são 2 e 3.\n",
    "conteudoCompleto": "A função quadrática, também chamada de função polinomial de 2º grau, é uma função representada pela seguinte expressão:\n\nf(x) = ax2 + bx + c\n\nOnde a, b e c são números reais e a ≠ 0.\n\nExemplo:\n\nf(x) = 2x2 + 3x + 5,\n\nsendo,\n\na = 2\nb = 3\nc = 5\n\nNesse caso, o polinômio da função quadrática é de grau 2, por ser o maior expoente da variável x.\n\nO conjunto domínio das funções quadráticas são os números reais, assim como seu contradomínio (f dois pontos reto números reais seta para a direita reto números reais). Já o conjunto imagem depende do vértice da parábola e de sua concavidade.\n\nGráfico da função quadrática: a parábola\nO gráfico das funções do 2º grau são curvas que recebem o nome de parábolas. Diferente das funções do 1º grau, onde conhecendo dois pontos é possível traçar o gráfico, nas funções quadráticas são necessários conhecer vários pontos.\n\nA curva de uma função quadrática corta o eixo x nas raízes ou zeros da função, em no máximo dois pontos dependendo do valor do discriminante (Δ). Assim, temos:\n\nSe Δ > 0, o gráfico cortará o eixo x em dois pontos;\nSe Δ < 0, o gráfico não cortará o eixo x;\nSe Δ = 0, a parábola tocará o eixo x em apenas um ponto.\nConcavidade do gráfico da função quadrática\nParábolas com concavidades opostas.\nRelação entre a parábola e os parâmetros a, b e c\nÉ possível identificar a posição da concavidade da curva analisando apenas o sinal do coeficiente a. Se o coeficiente for positivo, a concavidade ficará voltada para cima e se for negativo ficará para baixo.\n\nO parâmetro b indica se a parábola corta o eixo y no ramo descendente ou ascendente. Caso o b seja negativo, a parábola cruza o eixo y na \"descida\", como na parábola da esquerda da imagem anterior. Já se o b for positivo, a parábola cruza o eixo y na \"subida\", como na parábola da direita da imagem anterior.\n\nO parâmetro c indica exatamente a ordenada do ponto onde a parábola cruza o eixo y. Ou seja, ele indica o valor do y no ponto onde a parábola corta seu eixo.\n\nExemplo da parábola da função f(x) = 2x2 + 3x + 5.\n\na = 2\nb = 3\nc =5\nSendo a um valor positivo, a parábola tem concavidade para cima.\n\nO parâmetro b também é positivo, logo a parábola cortará o eixo y na subida.\n\nAinda, a parábola irá cortar o eixo y na ordenada 5.\n\nParábola do exemplo.\n\nComo a parábola não cruza o eixo x, esse é um caso em que Δ < 0.\n\nA partir dos pares ordenados dados (x, y), podemos construir a parábola num plano cartesiano, por meio da ligação entre os pontos encontrados.\n\nAprenda mais sobre:\n\nFunções do 1º grau\nVértice da parábola\nAinda com dúvidas? Pergunta ao Ajudante IA do Toda Matéria\nCaracteres: 0/900\nUtilizações: 0/5\nResolver\nInsira ou cole sua questão (Ctrl + V). Depois, aperte Resolver.\nColar texto\nou\nInserir imagem\nRaízes da Função\nAs raízes ou zeros da função do segundo grau representam aos valores de x tais que f(x) = 0. As raízes da função são determinadas pela resolução da equação de segundo grau, bastante fazer f(x) = 0.\n\n\nRemover anúncios\n0 = ax2 +bx + c\n\nPara resolver a equação do 2º grau podemos utilizar vários métodos, sendo um dos mais utilizados é aplicando a Fórmula de Bhaskara, ou seja:\n\nFunção Quadrática\n\nFunção Quadrática\n\nExemplo de cálculo das raízes da função f(x) = x2 – 5x + 6.\n\nResolução:\n\nSendo\na = 1\nb = – 5\nc = 6\n\nSubstituindo esses valores na fórmula de Bhaskara, temos:\n\nreto x igual a numerador menos reto b mais ou menos raiz quadrada de reto b ao quadrado menos 4 ac fim da raiz sobre denominador 2 reto a fim da fração reto x igual a numerador 5 mais ou menos raiz quadrada de 25 menos 24 fim da raiz sobre denominador 2 fim da fração reto x igual a numerador 5 mais ou menos raiz quadrada de 1 sobre denominador 2 fim da fração reto x com 1 subscrito igual a numerador 5 mais 1 sobre denominador 2 fim da fração igual a 6 sobre 2 igual a 3 reto x com 2 subscrito igual a numerador 5 menos 1 sobre denominador 2 fim da fração igual a 4 sobre 2 igual a 2\n\nPortanto, as raízes são 2 e 3.",
    "dataCriacao": "2025-12-28T14:28:28.297Z"
  }
]